app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ARTICLE 8 TITLE"], ["body", "ARTICLE 8 BODY"], ["created_at", "2016-03-12 17:31:00.231917"], ["updated_at", "2016-03-12 17:31:00.231917"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "4 Terrible Stocks"], ["updated_at", "2016-03-12 18:07:02.431586"], ["id", 4]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)